Repository: haruyama/ssh_rfc_ja
Catalog: omegat/ssh/ssh-level2.tmx
Source language: en_us
Languages: ja

source: [RFC3447] suggests using a hash with an output length of twice the security level required, so SHA-1 is appropriate for applications requiring up to 80 bits of security, and SHA-256 for those requiring up to 128 bits.
ja: [RFC3447] は, 要求されるセキュリティレベルの2倍の出力長を持つハッシュの利用を示唆している. SHA-1 は 80 bit までのセキュリティを要求するアプリケーションに適している. SHA-256 は 128bit までを要求するものに適している.

source: Authentication Using GSS-API Key Exchange ......................19 5.
ja: GSS-API 鍵交換を利用する認証 ......................19 5.

source: The message numbers 30-49 are key-exchange-specific and in a private namespace defined in [RFC4250] that may be redefined by any key exchange method [RFC4253] without requiring an IANA registration process.
ja: [RFC4250] でメッセージ番号は鍵交換特有なプライベートな名前空間と定義されている. この空間は, [RFC4253]で IANAの登録手続きを必要とせずに, 任意の鍵交換法で再定義してよいとされている.

source: Comment Header ......................................4 3.3.3.
ja: Comment ヘッダ ......................................4 3.3.3.

source: This attribute SHOULD NOT be critical.
ja: この属性は critical にしないほうがよい.

source: However, peers sending such chains should recognize that such chains are more likely to be unverifiable than chains that use only algorithms listed in the server_host_key_algorithms field.
ja: しかし, そのようなチェーンを送るピアは, server_host_key_algorithmsに挙げられているアルゴリズムのみを用いたチェーンにくらべてそのようなチェーンが検証されにくいことを認識する必要がある.

source: A full description of the ECMQV primitive can be found in Section 3.4 of [SEC1].
ja: ECMQV プリミティブの完全な説明は, [SEC1] の 3.4 節にある.

source: It defines an SSH user- authentication method that uses a specified GSS-API mechanism to authenticate a user; it also defines a family of SSH key-exchange methods that use GSS-API to authenticate a Diffie-Hellman key exchange.
ja: ユーザを認証する特定のGSS-APIメカニズムを用いるSSHユーザ認証法と Diffie-Hellman 鍵交換を認証するためにGSS-APIを用いるSSHの鍵交換法のファミリを定義する.

source: As described in Section 7.2 of [RFC4253], a hash-based key derivation function (KDF) is applied to the shared secret value K to generate the required symmetric keys.
ja: [RFC4253] の 7.2 節で記述されているように, ハッシュベースの鍵導出関数 (KDF) が, 必要な対称鍵を生成するために 共有の秘密の値 K に適用される.

source: Otherwise, authentication methods may be executed out of order.
ja: そうでなければ， 認証法は順不同で実行されるかもしれない．

source: Public Key Subsystem Operations
ja: 公開鍵サブシステムの操作

source: This approach might be useful to ensure that an SSH session to a given target can be established before it becomes important to send a message over the SSH session.
ja: このアプローチは, SSH セッション越しにメッセージを送信するのが重要になる前に 特定のターゲットへの SSH セッションが確立されるのを保証するのに役立つだろう.

source: The following ciphers are currently defined:
ja: 現在次の暗号が定義されている:

source: In this mode, the server SHOULD NOT send the Carriage Return character (ASCII 13) after the identification string.
ja: このモードでは, サーバは識別文字列のあとのキャリッジリターン (ASCII 13) を送らないほうがよい.

source: Architecture ....................................................4 4.1.
ja: アーキテクチャ ................................................4 4.1.

source: Channel Connection Failure Reason Codes and Descriptions
ja: チャンネル接続失敗の reason code (理由コード)と description(説明)

source: Challenge-response and One Time Password mechanisms are also easily supported with this authentication method.
ja: チャレンジ-レスポンスとワンタイムパスワードのメカニズムは, この認証法で容易にサポートされる

source: The motivation here is that, if an encryptor were to use SDCTR mode to encrypt more than 2**L blocks with the same key, then the encryptor would reuse keystream, and the reuse of keystream can lead to serious privacy attacks [SCHNEIER].
ja: ここでの動機は以下の通り. 暗号者が SDCTRモードにで同じ鍵で 2**L より多い暗号化して鍵ストリームを再利用すると, 鍵ストリームの再利用が深刻な秘匿性への攻撃を導くことがある [SCHNEIER].

source: It attempts to do this in a way that is easy to deploy, even at the cost of absolute security.
ja: SSHは, 完全なセキュリティを犠牲にしてでも, 簡単に配置できるやり方でセキュリティを向上しようとする.

source: The server sends to the client an RSA public key, K_T, to which the server holds the private key.
ja: サーバはクライアントに サーバが秘密鍵を保持しているRSA 公開鍵 K_T を送る.

source: The SSH Transport Model performs the following tasks.
ja: SSH トランスポートモデルは次のタスクを実行する.

source: Not all elliptic curves are secure, even if they are over a large field.
ja: すべての楕円曲線は安全ではない. たとえ大きなフィールド上のものだったとしてもだ.

source: See Section 6, Algorithm Naming, for more information.
ja: 「セクション 6. アルゴリズムの命名」にさらなる情報がある.

source: In the Key Exchange Method Names registry: The SSH key exchange method name "ecmqv-sha2" to name the key exchange method defined in Section 5.
ja: 鍵交換法名レジストリに: SSH鍵交換法名 "ecmqv-sha2" を 5節で定義した鍵交換法を指定するために登録.

source: The method name for each method is the concatenation of the string "gss- gex-sha1-" with the Base64 encoding of the MD5 hash [MD5] of the ASN.1 DER encoding [ASN1] of the underlying GSS-API mechanism's OID.
ja: 各方法の方法名は， 文字列 "gss-gex-sha1-" と， 基底のGSS-API メカニズム OID の ASN.1 DER エンコーディング [ASN1] の MD5 ハッシュの Base64 エンコーディングの連結だ．

source: Certificates and public keys are encoded as follows:
ja: 証明書と公開鍵は次のようにエンコードされる:

source: Header-tags beginning with "x-" are reserved for private use, as defined in [RFC2434].
ja: "x-" で始まる Header-tags は, [RFC2434] で定義されているように, 私的利用のために予約されている.

source: Public key/certificate formats that do not explicitly specify a signature format identifier MUST use the public key/certificate format identifier as the signature identifier.
ja: 明示的に署名のフォーマット識別子が指定されていない公開鍵/証明書のフォーマットは, 署名の識別子として鍵/証明書フォーマット識別子を利用しなければならない.

source: Implementations SHOULD decrypt the length after receiving the first 8 (or cipher block size, whichever is larger) bytes of a packet.
ja: 実装は, パケットの最初の8byte(ないし暗号のブロックサイズ, どちらか大きいほう)を受信したら長さを復号する必要がある.

source: The tmSecurityName should be the SSH user name.
ja: tmSecurityName は SSHのユーザ名である必要がある.

source: Key Exchange and Server Authentication ..........................8 4.1.
ja: 鍵交換とサーバ認証 ..........................8 4.1.

source: The IANA considerations for the SSH protocol as defined in [SSH-ARCH], [SSH-USERAUTH], [SSH-CONNECT], and this document, are detailed in [SSH-NUMBERS].
ja: [SSH-ARCH], [SSH-USERAUTH], [SSH-CONNECT] とこの文書で定義される SSH プロトコルに対する IANA の考慮は, [SSH-NUMBERS]

source: Its cryptographic properties are sufficiently described in [RFC2410], which will show that its use does not meet the intent of this protocol.
ja: "none" の性質は, [RFC2410]に詳述されている. "none" の利用はこのプロトコルの目的に一致しないことが示されている.

source: The counter X is then incremented, and the process is repeated for each subsequent block in order to generate
ja: そして カウンタ X をインクリメントする. パケット P に対応する全暗号文 C=C1||C2||...||Cn を生成するために, 後続のブロックに対してこのプロセスが繰替えされる.

source: The default approach is for an administrator to statically preconfigure this information to identify the targets authorized to receive notifications or received proxied messages.
ja: デフォルトのアプローチでは, 通知を受け取る権限があるターゲットかプロキシされたメッセージを受け取るターゲットかを識別する情報を管理者が事前に静的に設定する.

source: As the user's shell is usually used to execute the subsystem, it is advisable for the subsystem protocol to have a "magic cookie" at the beginning of the protocol transaction to distinguish it from arbitrary output generated by shell initialization scripts, etc. This spurious output from the shell may be filtered out either at the server or at the client.
ja: サブシステムを実行するのにユーザのシェルが通常使われるので, サブシステムのプロトコルはシェルの初期化スクリプトなどで生成される任意の出力とプロトコルのトランザクションの開始時を区別するために"magic cookie"を持つことが望ましい. シェルからの誤った出力は, サーバないしクライアントのどちらかでフィルタされうる.

source: o There are no restrictions or suggestions for the range starting with 0xFF.
ja: o 0xFFで始まる範囲については, 制限や示唆はない.

source: o All encryption, integrity, and public key algorithms used are well-known, well-established algorithms.
ja: o すべての暗号, 完全性, 公開鍵アルゴリズムには, よく知られ確立したアルゴリズムを利用する.

source: Data Type Representations Used in the SSH Protocols
ja: SSH プロトコルで利用されるデータ型の表現

source: The LineFeed required by the start of the end-of- chunks block immediately follows the last '>' character in the message.
ja: end-of-chunks の最初に必要なラインフィードが, メッセージの最後の '>' 文字にすぐに続いている.

source: Registrations .
ja: 登録 .

source: The name for this authentication method is "keyboard-interactive".
ja: この認証法の名前は, "keyboard-interactive" だ.

source: The channel is considered closed for a party when it has both sent and received SSH_MSG_CHANNEL_CLOSE, and the party may then reuse the channel number.
ja: どちらの側もSSH_MSG_CHANNEL_CLOSE を送受信したらチャンネルは終了したと見なされる. この後でチャンネル番号は再利用されるかもしれない.

source: compression_algorithms A name-list of acceptable compression algorithms in order of preference.
ja: compression_algorithms 受け入れ可能な圧縮アルゴリズムの優先度順の名前リスト.

source: Represents multiple precision integers in two's complement format, stored as a string, 8 bits per byte, MSB first.
ja: 2 の補数形式の多倍精度整数. string 形式で, byteごとに8 bit, MSB(最上位ビット)が先頭の形式で格納される.

source: Responses to Authentication Requests
ja: 認証の要求に対する返答

source: To initiate SSH connections, an entity must be configured with SSH client credentials plus information to authenticate the server.
ja: SSH 接続を開始するには, エンティティが, SSH のクライアント資格情報とサーバを認証する情報を持って設定されていなければならない.

source: Encryption Method Considerations
ja: 暗号モードの考察

source: Some applications allow use of a truncated version of this tag.
ja: アプリケーションは, このタグの切り詰められたバーンを使うことができる.

source: Constraints
ja: 制約

source: 4 VKILL Kill the current input line.
ja: 4 VKILL 現在の入力行を消す.

source: Review of Secure Shell ..........................................4 5.1.
ja: セキュアシェルの復習 ..........................................4 5.1.

source: Most of the constraints described in this section can be achieved by severely restricting the kex_algorithm, encryption_algorithm, and mac_algorithm name lists offered in the SSH_MSG_KEXINIT packet.
ja: この節で記述した制約のほとんどは, SSH_MSG_KEXINIT パケットで提供される kex_algorithm, encryption_algorithm, mac_algorithm name-list を厳しく制限することで達成可能だ.

source: 33 ISTRIP Strip 8th bit off characters.
ja: 33 ISTRIP 文字の8bit目を落す.

source: This is an authentication that is not otherwise possible with other authentication methods.
ja: これは, 他の認証法では不可能な認証だ.

source: The Channel Connection Failure 'reason code' is a uint32 value.
ja: チャンネル接続失敗の 'reason code' は uint32 の値だ.

source: IANA added the following two entries to the secure shell MAC Algorithm Names registry described in [RFC4250]:
ja: IANA は, [RFC4250] で記述された secure shell MAC Algorithm Names registry に以下の2つのエントリを追加した.

source: Clients MUST be able to process such lines.
ja: クライアントは, これらの行を処理できる必要がある.

source: The preferred way to do this is to rekey after receiving more than 2**31 packets since the last rekey operation.
ja: これを行なうために好ましい方法は, 最後の再生成操作の後に2**31個以上のパケットを受け取ったら鍵の再生成をすることだ.

source: This memo describes a method for invoking and running the SNMP protocol within a Secure Shell (SSH) session as an SSH Subsystem.
ja: このメモは, セキュアシェル (SSH) のサブシステムとして SSH セッション中で SNMP プロトコルを起動し実行する方法を記述する.

source: This is important because a client processing an error token will likely disconnect without reading any further messages.
ja: エラートークンを処理するクライアントがそれ以上のメッセージを読むことなく切断できるので, これは重要だ.

source: Requests for assignments of new opcodes and their associated arguments MUST be done through the IETF CONSENSUS method, as described in [RFC2434].
ja: 新しいオペコードと関連する引数の割り当ての要求は, [RFC2434] に記述されている IETF CONSENSUS によってされなければならない.

source: New Client, Old Server
ja: 新しいクライアントで古いサーバ

source: The method name for each method is the concatenation of the string "gss-group14-sha1-" with the Base64 encoding of the MD5 hash [MD5] of the ASN.1 DER encoding [ASN1] of the underlying GSS-API mechanism's OID.
ja: 各方法の方法名は， 文字列 "gss-group14-sha1-" と， 基底のGSS-API の OID の ASN.1 DER エンコーディング [ASN1] の MD5 ハッシュの Base64 エンコーディングの連結だ．

source: [RFC4086] offers suggestions for sources of random numbers and entropy.
ja: [RFC4086] は, 乱数とエントロピーについての示唆を提供する.

source: In order to implement public key authentication, SSH implementations must share public key files between the client and the server in order to interoperate.
ja: 公開鍵認証の実装で, SSHの実装は相互運用のために公開鍵ファイルをクライアントとサーバで共有しなければならない.

source: Generic Security Service Application Program Interface (GSS-API) Authentication and Key Exchange for the Secure Shell (SSH) Protocol
ja: セキュア シェル (SSH) プロトコルのための汎用セキュリティサービスアプリケーションプログラムインタフェイス(GSS-API) 認証と鍵交換

source: No common key management solution exists in current implementations.
ja: 現在の実装では, 共通の鍵管理ソリューションは存在しない.

source: The optional "user@" prefix component of the SnmpSSHAddress Textual Convention allows the client SNMP stack to associate the connection with a securityName that may be different than the SSH user name presented to the SSH server.
ja: SnmpSSHAddress のテキスト規約のオプションの "user@" プレフィックス部分は, SSH サーバに提示される SSH のユーザ名と異なる securityName と接続を関連付けることを クライアントのSNMP スタックができるようにする.

source: 31 PARMRK Mark parity and framing errors.
ja: 31 PARMRK パリティーとフレームのエラーをマークを追加する.

source: Key Exchange and Server Authentication
ja: 鍵交換とサーバ認証

source: This character sequence cannot legally appear in an XML document, so it can be unambiguously used to identify the end of the current document, allowing resynchronization of the NETCONF exchange in the event of an XML syntax or parsing error.
ja: この文字列は, XML 文書で正当に現われることはないので, 現在の文書の終端を識別するのに間違いなく利用できる. これにより XML の文法やパースのエラー時に NETCONF 交換を再実行できる.

source: - without authentication and without privacy (noAuthNoPriv)
ja: - 認証なし, プライバシーなし (noAuthNoPriv)

source: o The minimum size of a TCP/IP header is 32 bytes.
ja: o TCP/IPのヘッダの最小サイズは, 32 byteだ.

source: The tmSecurityName used to establish the SSH session must be the only tmSecurityName used with the session.
ja: SSH セッションを確立するのに用いた tmSecurityName は, セッションで用いる唯一の tmSecurityName でなければならない.

source: ECMQV Key Exchange ..............................................8 6.
ja: ECMQV 鍵交換 ..............................................8 6.

source: Local Security Policy ..............................22 9.4.4.
ja: ローカルなセキュリティポリシー ...................22 9.4.4.

source: Requirements Terminology ........................................2 3.
ja: 要件に関する用語 ........................................2 3.

source: If prompts are presented in a dialog window, then the client SHOULD NOT present each prompt in a separate window.
ja: ダイアログウィンドウで prompt が表示される際, クライアントはそれぞれのpromptを別のwindowで表示しないほうがよい.

source: Leading zeros are prohibited, and the maximum allowed chunk-size value is 4294967295.
ja: 先頭のゼロは禁止されている. また 許可される最大の chunk-size の値は, 4294967295 だ.

source: To encrypt a packet P=P1||P2||...||Pn (where P1, P2, ..., Pn are each blocks of length L), the encryptor first encrypts <X> with <cipher> to obtain a block B1.
ja: パケット P=P1||P2||...||Pn (P1, P2, ..., Pn はそれぞれ長さ L のブロック) を暗号化するため, 暗号化器は まず <X>を <cipher> で暗号化しブロック B1を得る.

source: A message digest of the public key, using the message digest algorithm specified in the SSHFP fingerprint type, MUST match the SSHFP fingerprint.
ja: ＳＳＨＦＰ の指紋のタイプで定義されたメッセージダイジェストアルゴリズムを使った公開鍵のメッセージダイジェストと SSHFP の指紋は一致しなければならない.

source: The conversion between a field element and an integer is specified in Section 2.3.9 of [SEC1].
ja: フィールド要素と整数との変換は, [SEC1]の2.3.9節で指定されている.

source: Note that channel open requests may be received until a reply to this message is received.
ja: チャンネルの開始の要求がこのメッセージが受信されるより前に受信されるかもしれないことに注意.

source: The algorithm for ECC key generation can be found in Section 3.2 of [SEC1].
ja: ECC 鍵生成のアルゴリズムは, [SEC1]の 3.2節にある.

source: To run NETCONF over SSH, the client will first establish an SSH transport connection using the SSH transport protocol, and the client and server will exchange keys for message integrity and encryption.
ja: SSH上でNETCONFを実行するのに, クライアントはまずSSHトランスポート接続をSSHトランスポートプロトコルを用いて確立し, クライアントとサーバはメッセージ完全性と暗号化のための鍵を交換する.

source: Pseudo-Random Number Generation ...........................13 9.2.
ja: 擬似乱数の生成 ...........................13 9.2.

source: This may be a concern for network administrators who wish to control the access of certain applications by users located outside of their physical location.
ja: アプリケーションの物理的な位置以外からのユーザによるアプリケーションのアクセスを制御したいネットワーク管理者にとって, これは懸念事項だろう.

source: These curves are defined in [SEC2].
ja: これらの曲線は [SEC2] で定義されている.

source: 50 to 59 User authentication generic 60 to 79 User authentication method specific (numbers can be reused for different authentication methods)
ja: 50 to 59 ユーザ認証一般 60 to 79 ユーザ認証法ごとに特有(番号は, 異なる方式で再利用されてもよい)

source: Maximum Packet Length
ja: 最大パケット長

source: The order of the names in a name-list may or may not be significant.
ja: name-listのnameの順序は, 重要かもしれないしそうでないかもしれない.

source: Public Key Authentication Method: "publickey"
ja: 公開鍵認証法: "publickey"

source: C verifies that K_S really is the host key for S (e.g., using certificates or a local database to obtain the public key).
ja: C は, K_S が本当に S のホスト鍵かを検証する(例えば, 証明書や公開鍵を得られるローカルなデータベースを用いて).

source: Key re-exchange is performed using whatever encryption was in effect when the exchange was started.
ja: 鍵の再交換は, 交換は始まる際に有効な暗号化などをすべて用いて行なわれる.

source: Elliptic Curve Digital Signature Algorithm
ja: 楕円曲線 Digital Signature Algorithm

source: Further, in environments in which GSS-API-based key exchange is used heavily, it is possible and even likely that host keys will change much more frequently and/or without advance warning.
ja: さらに, GSS-API ベースの鍵交換がよく利用される環境では, ホスト鍵は非常に頻繁に かつ/もしくは 事前の警告なしに変わる可能性がある.

source: Thus, the encoded version of K is always small enough to be encrypted under K_T.
ja: それゆえ, Kのエンコードされたバージョンは K_T で暗号化されるのに常に十分小さい.

source: These messages may reveal surprising amounts of information about the host if not properly designed.
ja: これらのメッセージは, 適切に設計されていないとホストについての大量の情報を漏らしてしまう.

source: Disconnection Message ....................................25 11.2.
ja: 切断メッセージ................................25 11.2.

source: However, for the common case of Diffie-Hellman (DH) signed by public keys, this requires the client to know the host's public key a priori and to verify that the correct key is being used.
ja: しかし, 公開鍵で署名される Diffee-Hellman (DH) の一般的な場合では, クライアントがホスト公開鍵をすでに知っていて正しい鍵が利用されているか検証できる必要がある.

source: Once a party has sent a SSH_MSG_KEXINIT message for key exchange or re-exchange, until it has sent a SSH_MSG_NEWKEYS message (Section 7.3), it MUST NOT send any messages other than:
ja: 一度, 一方の側が 鍵交換ないし鍵の再交換のために SSH_MSG_KEXINIT メッセージを送ったら, SSH_MSG_NEWKEYS メッセージを送るまで (7.3節参照) 以下以外のメッセージを送ってはならない:

source: When this notation is used in an SnmpSSHAddress, the SSH connection should be established with an SSH user name matching the "user" portion of the notation when establishing a session with the remote SSH server.
ja: この表記法を SnmpSSHAddress で用いる場合, リモートのSSHサーバとセッションを確立する際に 表記の "user" 部分と一致する SSH ユーザ名を用いて SSH 接続を確立する必要がある.

source: The space of header-tags is managed as described in Section 5.
ja: header-tag の空間は, 5節で記述するように管理される.

source: This protocol negotiates a mutually acceptable set of cryptographic algorithms and produces a secret value K and an exchange hash H that are shared by the client and server.
ja: このプロトコルは, 相互に受け入れ可能な暗号アルゴリズムの集合を交渉し, クライアントとサーバで共有される秘密の値 K と交換ハッシュ H を生成する.

source: In order to allow SNMP traffic to be easily identified and filtered by firewalls and other network devices, servers associated with SNMP entities using the Secure Shell Transport Model MUST default to providing access to the "snmp" SSH Subsystem if the SSH session is established using the IANA- assigned TCP ports (5161 and 5162).
ja: SNMP のトラフィックを容易に識別しファイアウォールや他のネットワークデバイスでフィルタするために, セキュアシェルトランスポートモデルを用いるSNMP エンティティに関連するサーバは, IANA に割り当てられた TCP ポート (5161 と 5162) を用いてSSHのセッションが確立された婆に "snmp" SSH サブシステムへのアクセスを提供するのをデフォルトとしなければならない.

source: This range is for private use.
ja: この範囲は, プライベートな利用用だ.

source: Public Key Subsystem Response Names
ja: 公開鍵サブシステムの応答名

source: The server MUST indicate its capabilities by sending an XML document containing a <hello> element as soon as the NETCONF session is established.
ja: サーバは, NETCONFのセッションが確立したらすぐに <hello> 要素を含む XML 文書を送ってその機能を示さなければならない.

source: Listing Server Capabilities
ja: サーバ機能の一覧の取得

source: Encryption will be done after compression.
ja: 圧縮のあとで, 暗号化が行なわれる.

source: If no "user@" portion is specified in the SnmpSSHAddress, then the SSH connection should be established using the tmSecurityName as the SSH user name when establishing a session with the remote SSH server.
ja: "user@" 部分が SnmpSSHAddress で指定されていなければ, リモートの SSH サーバとセッションを確立する際に SSH のユーザ名として tmSecurityName を用いて SSH 接続を確立する必要がある.

source: The client requests a modulus from the server, indicating the minimum, maximum, and preferred sizes; the server responds with a suitable modulus and generator.
ja: クライアントはサーバから法(modulus)を, 最小値， 最大値， 推奨のサイズを指定して， 要求する． サーバは適切な法と生成器で応答する．

source: 11 VDSUSP Another suspend character.
ja: 11 VDSUSP 別の中断文字.

source: An implementation of SecSh-B must be validated by the appropriate authority before such usage is permitted.
ja: SecSh-B の実装は, そのような利用が許可される前に適切な機関によって検証されなければならない.

source: For example, one might want to use smaller packets for interactive connections to get better interactive response on slow links.
ja: たとえば, 遅い回線でよりよいインタラクティブな返答を得るために, インタラクティブな接続で一方の側がより小さいパケットを用いるように求める場合がある.

source: Due to its small key sizes and its inclusion in the National Security Agency's Suite B, Elliptic Curve Cryptography (ECC) is becoming a widely utilized and attractive public-key cryptosystem.
ja: 鍵サイズが小さいことと National Security Agencyの Suite B に含まれていることから, 楕円曲線暗号 (ECC) は広く利用され魅力的な公開鍵暗号システムとなってきている.

source: The server SHOULD make every effort to preserve this value and return it with the key during any subsequent list operation.
ja: サーバは, この値を保持しその後の一覧取得操作で鍵とともに返すためにあらゆる努力をする必要がある.

source: No data may be sent to a channel until a message is received to indicate that window space is available.
ja: window のスペースがあることを示すメッセージが受けとられるまで, チャンネルにはデータは送られない.

source: An implementation MAY choose not to support this request.
ja: 実装は, この要求をサポートしないことを選択してもよい.

source: Thus, the increase is no more than 5 bytes.
ja: このため, 増大は, 5byteよりも大きくならない.

source: Compression MUST be independent for each direction, and implementations MUST allow independent choosing of the algorithm for each direction.
ja: 圧縮は, 通信の方向それぞれで独立でなければならない. また, 実装は方向それぞれについてアルゴリズムを独立に選択できなければならない.

source: The key exchange and server authentication are performed by the SSH_MSG_KEXECDH_REPLY packets (see Section 4).
ja: 鍵交換とサーバ認証は, SSH_MSG_KEXECDH_REPLY パケットにより実施される (4 節を参照).

source: If the num-responses field does not match the num-prompts field in the request message, the server MUST send a failure message.
ja: num-responses フィールドが 要求メッセージの num-prompts フィールドと一致しない場合, サーバは, 失敗メッセージを送らなければならない.

source: Since the user authentication process will involve the exchange of only a single token once the context has been established, it is not necessary that the context support detection of replayed or out-of- sequence tokens.
ja: 一度コンテクストが確立されると鍵交換プロセスは単一のトークンの交換のみ実行されるので, コンテクストは再送やシーケンスを外れたトークンの検出をサポートする必要はない.

source: This identification string MUST be
ja: この接続文字列は, 次の形式でなければならない.

source: C sends "min || n || max" to S, indicating the minimal acceptable group size, the preferred size of the group, and the maximal group size in bits the client will accept.
ja: C は S に "min || n || max" を送り, 群のサイズの最小受容値と希望値, 最大値をbitで示す.

source: Password Authentication ............................23 9.4.6.
ja: パスワード認証 ............................23 9.4.6.

source: It provides strong encryption, cryptographic host authentication, and integrity protection.
ja: このプロトコルは, 強力な暗号化, ホストの認証, 完全性の保護を提供する.

source: The connection protocol provides channels that can be used for a wide range of purposes.
ja: コネクションプロトコルは, 広い範囲の目的に利用できるチャンネルを提供する

source: The hostname is followed by a colon ':' (US-ASCII character 0x3A) and a decimal port number in US-ASCII.
ja: ホスト名の後に コロン ':' (US-ASCII 文字 0x3A) と US-ASCII の10進のポート番号が続く.

source: There are two formats for algorithm and method names:
ja: アルゴリズムと方式の名前には2つの形式がある:

source: Output: Failure_Indicator; // Returned if the authentication tag // is invalid octet_string PT; // Plain Text, returned if and only if // the authentication tag is valid
ja: Output: Failure_Indicator; // 認証タグが不正の場合に返す. octet_string PT; // 平文. 認証タグが正当な場合にのみ返る.
